app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data)
    {
        return User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => bcrypt($data['password']),
        ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('AngryCat', '986211544@qq.com', 'y$NakEj6SV9e33uVMsXAzh/.cV7kjzkvHTNjX5m7SIb87xhGALZpGN6', '2017-07-17 21:42:44', '2017-07-17 21:42:44')