app/Common/function.php

select * from `tags` where `id` = '1' limit 1
---
	function getTagNameByIds($id)
	{
		if($id =='0'){
			return '';
		}
		$info = DB::table('tags')->where('id','=',$id)->first();