app/Http/Controllers/HomeController.php

select * from `users` where `users`.`id` = '1' limit 1
---
    public function index()
    {

    	$user = Auth::id();
    	//判断用户是否登录
    	if(!empty($user)){
    		 // 获取用户关注的话题
    		$tagsId = \App\User::find($user)->followings(\App\Tag::class)->get();