app/Http/Controllers/PeopleController.php

select * from `user_details` where `user_details`.`user_id` = '4' limit 1
---
    public function activities()
    {
        $_SESSION['id'] = Auth::id();
        $user_id = User_detail::find(Auth::id());

select * from `user_details` where `user_details`.`user_id` = '4' limit 1
---
    public function activitie($id)
    {
        $_SESSION['id'] = $id;

        $user_id = User_detail::find($id);