app/Http/Controllers/TopicController.php

    public function index($id)
     {
        if(empty($id)){
            return redirect('/');
        }
        //获取用户id
        $user = Auth::id();
        // 检测是否为空
        if(empty($user)){
            return redirect('/login');
        } else {
            //通过用户ID查询关联的话题
            $tagsId = \App\User::find($user)->followings(\App\Tag::class)->get();

            //判断此用户是否关注了话题 无关注则跳话题广场
            if(empty($tagsId[0])){
                return redirect('/topic');
            }

            // 获取话题的ID
            $tagid=[];
            foreach ($tagsId as $key => $value) {
                array_push($tagid, $value->id);
            }
            //获取用户关注话题的个数
            $count = count($tagid);
            //获得话题
            $tags = DB::table('tags')->whereIn('id',$tagid)->orderBy('id')->get();
            $topic = DB::table('tags')->where('id',$id)->get();
---
select * from `users` where `users`.`id` = '2' limit 1
select * from `tags` where `id` in ('1') order by `id` asc

            $tag_name = $topic[0]->tag_name;
            $id = $topic[0]->id;
           //多个话题有多个问题 多对多
            $dat = Tag::find($id);
---
select * from `tags` where `tags`.`id` = '1' limit 1

            foreach ($question as $key => $value) {
                array_push($qs_id, $value->id);
            }
            $res = DB::table('questions')
                ->whereIn('id', $qs_id)
                ->orderBy('created_at', 'desc')
                ->get();
            $huati= DB::table('tags')->paginate(5);
---
select * from `questions` where `id` in ('7', '9', '4') order by `created_at` desc
select * from `tags` limit 5 offset 0
select count(*) as aggregate from `tags`

                $data[$qs_id[$i]] =  self::browseAnswer($qs_id[$i]);
            }
            //用户关注话题
            $tag_htid = \App\User::find($user)->followings(\App\Tag::class)->get();
---
select * from `users` where `users`.`id` = '2' limit 1

             // dd( $tag_ids);

              //用户关注的问题
            $tagss = \App\User::find($user)->followings(\App\question::class)->get();
---
select * from `users` where `users`.`id` = '2' limit 1

    public function topicTimeTag($id)
     {
        if(empty($id)){
            return redirect('/');
        }
        //获取用户id
        $user = Auth::id();
        // 检测是否为空
        if(empty($user)){
            return redirect('/login');
        } else {
            //通过用户ID查询关联的话题
            $tagsId = \App\User::find($user)->followings(\App\Tag::class)->get();

            //判断此用户是否关注了话题 无关注则跳话题广场
            if(empty($tagsId[0])){
                return redirect('/topic');
            }

            // 获取话题的ID
            $tagid=[];
            foreach ($tagsId as $key => $value) {
                array_push($tagid, $value->id);
            }
            //获取用户关注话题的个数
            $count = count($tagid);
            //获得话题
            $tags = DB::table('tags')->whereIn('id',$tagid)->orderBy('id')->get();
            $topic = DB::table('tags')->where('id',$id)->get();
---
select * from `users` where `users`.`id` = '2' limit 1
select * from `tags` where `id` in ('1') order by `id` asc

            $tag_name = $topic[0]->tag_name;
            $id = $topic[0]->id;
           //多个话题有多个问题 多对多
            $dat = Tag::find($id);
---
select * from `tags` where `tags`.`id` = '1' limit 1

            foreach ($question as $key => $value) {
                array_push($qs_id, $value->id);
            }
            $res = DB::table('questions')
                ->whereIn('id', $qs_id)
                ->orderBy('created_at', 'desc')
                ->get();
            $huati= DB::table('tags')->paginate(5);
---
select * from `questions` where `id` in ('7', '9', '4') order by `created_at` desc
select * from `tags` limit 5 offset 0
select count(*) as aggregate from `tags`

                $data[$qs_id[$i]] =  self::TimeAnswer($qs_id[$i]);
            }
            //用户关注话题
            $tag_htid = \App\User::find($user)->followings(\App\Tag::class)->get();
---
select * from `tags` where `pid` = '1'
select * from `users` where `users`.`id` = '2' limit 1

             // dd( $tag_ids);

              //用户关注的问题
            $tagss = \App\User::find($user)->followings(\App\question::class)->get();
---
select * from `users` where `users`.`id` = '2' limit 1

    public static function TimeAnswer($qs_id)
     {
        $res = DB::table('answers as ans')
            ->join('users', 'ans.user_id', '=', 'users.id')
            ->join('user_details as userinfo', 'ans.user_id', '=', 'userinfo.user_id')
            ->where('ans.question_id',$qs_id)
            ->select('ans.*', 'users.name', 'userinfo.a_word')
            ->orderBy('created_at', 'desc')
            ->first();
---
select `ans`.*, `users`.`name`, `userinfo`.`a_word` from `answers` as `ans` inner join `users` on `ans`.`user_id` = `users`.`id` inner join `user_details` as `userinfo` on `ans`.`user_id` = `userinfo`.`user_id` where `ans`.`question_id` = '7' order by `created_at` desc limit 1

    public static function oneAnswer($qs_id)
     {
        $res = DB::table('answers as ans')
            ->join('users', 'ans.user_id', '=', 'users.id')
            ->join('user_details as userinfo', 'ans.user_id', '=', 'userinfo.user_id')
            ->where('ans.question_id',$qs_id)
            ->select('ans.*', 'users.name', 'userinfo.a_word')
            ->orderBy('vote_count', 'acs')
            ->first();
---
select `ans`.*, `users`.`name`, `userinfo`.`a_word` from `answers` as `ans` inner join `users` on `ans`.`user_id` = `users`.`id` inner join `user_details` as `userinfo` on `ans`.`user_id` = `userinfo`.`user_id` where `ans`.`question_id` = '7' order by `vote_count` desc limit 1

    public static function browseAnswer($qs_id)
     {
        $res = DB::table('answers as ans')
            ->join('users', 'ans.user_id', '=', 'users.id')
            ->join('user_details as userinfo', 'ans.user_id', '=', 'userinfo.user_id')
            ->where('ans.question_id',$qs_id)
            ->select('ans.*', 'users.name', 'userinfo.a_word')
            ->orderBy('browse', 'desc')
            ->first();
---
select `ans`.*, `users`.`name`, `userinfo`.`a_word` from `answers` as `ans` inner join `users` on `ans`.`user_id` = `users`.`id` inner join `user_details` as `userinfo` on `ans`.`user_id` = `userinfo`.`user_id` where `ans`.`question_id` = '7' order by `browse` desc limit 1

    public function topicHot($id)
     {
        if(empty($id)){
            return redirect('/');
        }

        $user = Auth::id();
        if(empty($user)){
            return redirect('/');
        } else {
             //获取话题id
            $topic = DB::table('tags')->where('id',$id)->get();
            $tag_name = $topic[0]->tag_name;
            $description = $topic[0]->description;
            $pid = $topic[0]->pid;
            $img = $topic[0]->img;
            $ids = $topic[0]->id;
            $count=\App\Tag::find($ids)->followers()->count();
            // dd($count);
            //多个话题有多个问题 多对多
            $data = Tag::find($id);
            $question = $data->question;
            // 获取问题ID
            $qs_id=[];
            foreach ($question as $key => $value) {
                array_push($qs_id, $value->id);
            }

            //连表查询用户,问题
            $res = DB::table('questions')
                ->whereIn('id', $qs_id)
                ->orderBy('created_at', 'desc')
                ->get();
            $huati= DB::table('tags')->paginate(5);
---
select * from `tags` where `tags`.`id` = '5' limit 1
select * from `tags` where `pid` = '0'
select * from `questions` where `id` in ('3', '7', '8') order by `created_at` desc
select * from `tags` limit 5 offset 0
select count(*) as aggregate from `tags`

            //子话题的数量
            $numsonTag = count($sonTag);
            //用户关注的问题
            $tags = \App\User::find($user)->followings(\App\Tag::class)->get();
---
select * from `tags` where `tags`.`id` = '1' limit 1
select * from `users` where `users`.`id` = '2' limit 1

            }

            //用户关注的问题
            $ques = \App\User::find($user)->followings(\App\Question::class)->get();
---
select * from `users` where `id` = '2' limit 1

    public function topicTime($id)
     {
        if(empty($id)){
            return redirect('/');
        }

        $user = Auth::id();
        if(empty($user)){
            return redirect('/');
        } else {
             //获取话题id
            $topic = DB::table('tags')->where('id',$id)->get();
            $tag_name = $topic[0]->tag_name;
            $description = $topic[0]->description;
            $pid = $topic[0]->pid;
            $img = $topic[0]->img;
            $ids = $topic[0]->id;
            $count=\App\Tag::find($ids)->followers()->count();
            //多个话题有多个问题 多对多
            $data = Tag::find($id);
            $question = $data->question;
            // 获取问题ID
            $qs_id=[];
            foreach ($question as $key => $value) {
                array_push($qs_id, $value->id);
            }

            //连表查询用户,问题
            $res = DB::table('questions')
                ->whereIn('id', $qs_id)
                ->orderBy('created_at', 'desc')
                ->get();
            $huati= DB::table('tags')->paginate(5);
---
select * from `tags` where `tags`.`id` = '1' limit 1
select * from `questions` where `id` in ('7', '9', '4') order by `created_at` desc
select * from `tags` limit 5 offset 0
select count(*) as aggregate from `tags`

                $data[$qs_id[$i]] =  self::TimeAnswer($qs_id[$i]);
            }
            // 父话题
            $tag= DB::table('tags')
             ->where('pid','=',0)
             ->get();
---
select * from `tags` where `pid` = '0'

            $numsonTag = count($sonTag);
            // $span = $sonTag[0]->tag_name;
            //用户关注的问题
            $tags = \App\User::find($user)->followings(\App\Tag::class)->get();
---
select * from `users` where `users`.`id` = '2' limit 1
select * from `tags` where `pid` = '5'

                $tag_ids[] = $v->id;
            }
            //用户关注的问题
            $ques = \App\User::find($user)->followings(\App\Question::class)->get();
---
select * from `users` where `id` = '2' limit 1

    public function topicRefined($id)
     {
        if(empty($id)){
            return redirect('/');
        }

        $user = Auth::id();
        if(empty($user)){
            return redirect('/');
        } else {
             //获取话题id
            $topic = DB::table('tags')->where('id',$id)->get();
            $tag_name = $topic[0]->tag_name;
            $description = $topic[0]->description;
            $pid = $topic[0]->pid;
            $img = $topic[0]->img;
            $ids = $topic[0]->id;
            $count=\App\Tag::find($ids)->followers()->count();
            //多个话题有多个问题 多对多
            $data = Tag::find($id);
            $question = $data->question;
            // 获取问题ID
            $qs_id=[];
            foreach ($question as $key => $value) {
                array_push($qs_id, $value->id);
            }

            //连表查询用户,问题
            $res = DB::table('questions')
                ->whereIn('id', $qs_id)
                ->orderBy('created_at', 'desc')
                ->get();
            $huati= DB::table('tags')->paginate(5);
---
select * from `tags` where `tags`.`id` = '1' limit 1
select * from `questions` where `id` in ('7', '9', '4') order by `created_at` desc
select * from `tags` limit 5 offset 0
select count(*) as aggregate from `tags`

            }
            // dd($data);
            // 父话题
            $tag= DB::table('tags')
             ->where('pid','=',0)
             ->get();
---
select * from `tags` where `pid` = '0'

            //子话题的数量
            $numsonTag = count($sonTag);
            //用户关注的问题
            $tags = \App\User::find($user)->followings(\App\Tag::class)->get();
---
select * from `tags` where `pid` = '5'
select * from `users` where `users`.`id` = '2' limit 1

    public function topicConcern()
     {
        // 话题的数量
        $tags =\App\Tag::all()->take(1);
        // 用户ID
        $user = Auth::id();
        // 获取用户关注的话题
        $tagsId = \App\User::find($user)->followings(\App\Tag::class)->get();
---
select * from `tags`
select * from `tags` where `pid` = '1'
select * from `users` where `users`.`id` = '1' limit 1

    public function getClassify($pid)
     {
        $tags = DB::table('tags')->where('pid','=',$pid)->get();
---
select * from `tags` where `pid` = '1'