app/Http/Controllers/TopicController.php

select * from `users` where `id` = '2' limit 1
---
    public function topicTimeTag($id)
    {
        if (empty($id)) {
            return redirect('/');
        }
        //获取用户id
        $user = Auth::id();
        // 检测是否为空
        if (empty($user)) {
            return redirect('/login');
        } else {
            //通过用户ID查询关联的话题
            $tagsId = \App\User::find($user)->followings(\App\Tag::class)->get();

select * from `tags` where `pid` = '5'
---
                $data[$qs_id[$i]] = self::TimeAnswer($qs_id[$i]);
            }
            //用户关注话题
            $tag_htid = \App\User::find($user)->followings(\App\Tag::class)->get();

select * from `users` where `users`.`id` = '2' limit 1
---
            // dd( $tag_ids);

            //用户关注的问题
            $tagss = \App\User::find($user)->followings(\App\question::class)->get();